In [1]:
import pandas as pd
from scipy import stats

# Q1

In [2]:
df = pd.read_excel('Sales Data.xlsx',skiprows=2)

In [3]:
df.head()

,Customer,Percent Gross Profit,Gross Sales,Gross Profit,Industry Code,Competitive Rating*
0,1,0.51,170.0,86.70,1.0,2.0
1,2,0.32,181.0,57.92,3.0,4.0
2,3,0.20,203.0,40.60,2.0,2.0
3,4,0.22,249.0,54.78,5.0,1.0
4,5,0.21,476.0,99.96,5.0,1.0

In [4]:
df.describe()

,Percent Gross Profit,Gross Sales,Gross Profit,Industry Code,Competitive Rating*
count,60.000000,60.000000,60.000000,60.000000,60.000000
mean,0.211925,25016.500000,4239.164583,4.483333,3.000000
std,0.114014,36344.568583,5811.729263,1.899970,1.089239
min,0.030000,170.000000,40.600000,1.000000,1.000000
25%,0.140000,2645.750000,435.060000,3.000000,2.000000
50%,0.200000,6760.000000,1662.430000,5.000000,3.000000
75%,0.245000,32171.000000,5690.385000,6.000000,4.000000
max,0.600000,179101.000000,25379.340000,7.000000,5.000000

In [5]:
ax = df['Gross Profit'].mean()

In [6]:
std=5811.729263
mean = 4239.164583
n=60
mu_not=4500

In [7]:
t = (mean - mu_not)/std/7.74
print('T test value is',t)

T test value is -0.005798560936693412

In [8]:
from scipy.stats import t

In [9]:
print('The critical Value is -',t.ppf(1-0.025,59))

The critical Value is - 2.00099537704821

In [10]:
from scipy.stats import ttest_1samp
pval=print(stats.ttest_1samp(df.dropna()['Gross Profit'],4500))

Ttest_1sampResult(statistic=-0.3476456590343202, pvalue=0.7293435113063342)

In [11]:
pvalue=0.7293435113063342
if (pvalue < 0.05):    # alpha value is 0.05
  print("null hypothesis rejected")
else:
  print("null hypothesis accepted")

null hypothesis accepted

# Q2

In [12]:
df1 = pd.read_excel('Ohio Education Performance.xlsx',skiprows=2)

In [13]:
df1 = df1.dropna()

In [14]:
print(stats.ttest_rel(df1["Writing"],df1["Reading"]))
print(stats.ttest_rel(df1["Math"],df1["Science"]))

Ttest_relResult(statistic=3.1358073586138238, pvalue=0.0037370619398733713)
Ttest_relResult(statistic=-7.978191276303862, pvalue=5.234100387897268e-09)

In [15]:
p1=0.0037370619398733713
p2=5.234100387897268e-09

In [16]:
if (p1,p2 < 0.05):    
  print("null hypothesis rejected")
else:
  print("null hypothesis accepted")

null hypothesis rejected

# Q3

In [17]:
df2 = pd.read_excel('Facebook Survey.xlsx',skiprows=2)
df2.head()

   Student  Gender  Hours online/week  Friends
0        1  female                  4      150
1        2  female                 10      400
2        3    male                  7      120
3        4    male                 15      500
4        5  female                  9      260

In [18]:
stats.f_oneway(df2['Hours online/week'][df2['Gender'] == 'female'],
               df2['Hours online/week'][df2['Gender'] == 'male'])

F_onewayResult(statistic=0.042866767821699577, pvalue=0.8373303530923235)

In [19]:
p_val=0.8373303530923235
if (p_val < 0.05):    
  print("null hypothesis rejected")
else:
  print("null hypothesis accepted")

null hypothesis accepted

# Q4

In [20]:
df3 = pd.read_excel('Consumer Transportation Survey.xlsx',skiprows=2)

In [21]:
df3.head()

,Vehicle Driven,Type,Satisfaction with vehicle,Gender,Age,# of hours per week in vehicle,Miles driven per week,Number of Children,Average number of riders,Miles from work
0,Truck,Domestic,Yes,Male,31,10,450,0,1,30
1,Truck,Domestic,Yes,Male,29,5,370,1,1,22
2,Truck,Foreign,No,Male,26,12,580,0,1,15
3,Truck,Domestic,No,Male,18,6,300,0,1,20
4,SUV,Domestic,Yes,Male,49,21,1000,0,1,22

In [22]:
print(stats.ttest_1samp(df3.dropna()['# of hours per week in vehicle'],8))
print(stats.ttest_1samp(df3.dropna()['Miles driven per week'],600))
if (0.827494218330276 < 0.05):   
  print("null hypothesis rejected")
else:
  print("null hypothesis accepted")

Ttest_1sampResult(statistic=0.2190845519343845, pvalue=0.827494218330276)
Ttest_1sampResult(statistic=-2.369407386313186, pvalue=0.02180041862974647)
null hypothesis accepted

In [23]:
if (0.02180041862974647 < 0.05):    
  print("null hypothesis rejected")
else:
  print("null hypothesis accepted")

null hypothesis rejected

In [24]:
sdf3=df3[df3['Vehicle Driven']=='SUV']

In [25]:
sdf3.head()

,Vehicle Driven,Type,Satisfaction with vehicle,Gender,Age,# of hours per week in vehicle,Miles driven per week,Number of Children,Average number of riders,Miles from work
4,SUV,Domestic,Yes,Male,49,21,1000,0,1,22
5,SUV,Foreign,Yes,Male,50,16,840,2,1,45
6,SUV,Domestic,Yes,Male,48,15,1400,3,4,25
7,SUV,Foreign,Yes,Male,45,5,300,2,2,20
8,SUV,Domestic,Yes,Male,45,15,850,0,1,25

In [26]:
print(stats.ttest_1samp(sdf3.dropna()['Age'],35))
if (0.043349319430440215 < 0.05):    
  print("null hypothesis rejected")
else:
  print("null hypothesis accepted")

Ttest_1sampResult(statistic=2.2210983164738285, pvalue=0.043349319430440215)
null hypothesis rejected

In [27]:
table = pd.crosstab(df3['Vehicle Driven'], df3['Satisfaction with vehicle'], normalize='index') * 100

In [28]:
table

Satisfaction with vehicle         No        Yes
Vehicle Driven
Car                        36.363636  63.636364
Mini Van                   22.222222  77.777778
SUV                        20.000000  80.000000
Truck                      50.000000  50.000000

# Q5

In [29]:
df4 = pd.read_excel("Vacation Survey.xlsx",skiprows=2)
df4.head()

   Age  Gender Relationship Status   Vacations/year  Number of Children
0   24    Male             Married                2                   0
1   26  Female             Married                4                   0
2   28    Male             Married                2                   2
3   33    Male             Married                4                   0
4   45    Male             Married                2                   0

In [30]:
df4.columns

Index(['Age', 'Gender', 'Relationship Status', ' Vacations/year',
       'Number of Children'],
      dtype='object')

In [31]:
stats.f_oneway(df4[' Vacations/year'][df4['Relationship Status'] == 'Married'],
               df4[' Vacations/year'][df4['Relationship Status'] == 'Single/Divorced'])

F_onewayResult(statistic=5.137876515182228, pvalue=0.030304942459291655)

In [32]:
pv_al=0.030304942459291655
if (pv_al < 0.05):    # alpha value is 0.05
  print("null hypothesis rejected")
else:
  print("null hypothesis accepted")

null hypothesis rejected

In [33]:
if (pv_al < 0.01):    # alpha value is 0.01
  print("null hypothesis rejected")
else:
  print("null hypothesis accepted")

null hypothesis accepted